In [16]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.DataFrame(np.random.randint(0, 10, (4,4)),
columns= list('ABCD'))

In [4]:
df - df['A']

    A   B   C   D   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [5]:
df

   A  B  C  D
0  6  7  6  2
1  2  1  7  0
2  2  5  8  3
3  3  2  1  4

In [6]:
df['A']

0    6
1    2
2    2
3    3
Name: A, dtype: int32

In [7]:
df['B'] - df['A']

0    1
1   -1
2    3
3   -1
dtype: int32

In [8]:
df - df.loc[0]

   A  B  C  D
0  0  0  0  0
1 -4 -6  1 -2
2 -4 -2  2  1
3 -3 -5 -5  2

In [9]:
df.loc[0]

A    6
B    7
C    6
D    2
Name: 0, dtype: int32

In [10]:
df['A']

0    6
1    2
2    2
3    3
Name: A, dtype: int32

In [15]:
df.subtract(df['A'], axis=0)

   A  B  C  D
0  0  1  0 -4
1  0 -1  5 -2
2  0  3  6  1
3  0 -1 -2  1

In [17]:
tip = sns.load_dataset("tips")

In [19]:
#1. find number of smokers of male and female

In [21]:
tip['smoker'].value_counts()

No     151
Yes     93
Name: smoker, dtype: int64

In [27]:
tip[['smoker']].groupby("smoker")

In [30]:
tip.groupby("smoker").count()

        total_bill  tip  sex  day  time  size
smoker
Yes             93   93   93   93    93    93
No             151  151  151  151   151   151

In [33]:
tip.groupby("smoker")['sex'].value_counts()

smoker  sex
Yes     Male      60
        Female    33
No      Male      97
        Female    54
Name: sex, dtype: int64

In [37]:
tip[tip['smoker'] == "Yes"]['sex'].value_counts()

Male      60
Female    33
Name: sex, dtype: int64

In [38]:
###2. Out of Male and females who paid the maximum bill and got maximum tip

In [42]:
tip[tip['total_bill'] == tip['total_bill'].max()]['sex']

170    Male
Name: sex, dtype: category
Categories (2, object): ['Male', 'Female']

In [43]:
tip[tip['tip'] == tip['tip'].max()]['sex']

170    Male
Name: sex, dtype: category
Categories (2, object): ['Male', 'Female']

In [44]:
### 3. on an average what is the percentage of tips recived when there is no smoker ?

In [47]:
temp = tip[tip['smoker'] == "No"]

In [48]:
# (total_tip/total_bill)*100

In [52]:
(temp['tip'].sum()/temp['total_bill'].sum())*100

15.592093683022542

In [53]:
### 4. What percentage of people are coming for lunch than of dinner?

In [55]:
tip['time'].value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

In [56]:
tip['time'].count()

244

In [58]:
tip['time'].value_counts().values

array([176,  68], dtype=int64)

In [63]:
(tip[tip['time'] == "Lunch"]['tip'].count() / tip[tip['time'] == "Dinner"]['tip'].count()) * 100

38.63636363636363

In [65]:
v = tip['time'].value_counts().values
(v[1] / v[0])*100

38.63636363636363

In [66]:
###5.

In [69]:
tip['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [72]:
ser = (tip['total_bill'] / tip['size'])

In [77]:
ser[ser == ser.max()].index[0]

184

In [78]:
tip.loc[184, 'total_bill']

40.55

In [80]:
tip.loc[184]

total_bill     40.55
tip                3
sex             Male
smoker           Yes
day              Sun
time          Dinner
size               2
Name: 184, dtype: object

In [81]:
###6. We can add a column of tip percentage which gives the percent of bill a customer pays as tip.
# According to the percent :
# on an average who pays more tip - people with family, couples or single

In [103]:
df1 = tip.copy()

In [106]:
df1['tip_per'] = (round(tip['tip'] / tip['total_bill'], 2)*100)

In [107]:
df1

     total_bill   tip     sex smoker   day    time  size  tip_per
0         16.99  1.01  Female     No   Sun  Dinner     2      6.0
1         10.34  1.66    Male     No   Sun  Dinner     3     16.0
2         21.01  3.50    Male     No   Sun  Dinner     3     17.0
3         23.68  3.31    Male     No   Sun  Dinner     2     14.0
4         24.59  3.61  Female     No   Sun  Dinner     4     15.0
..          ...   ...     ...    ...   ...     ...   ...      ...
239       29.03  5.92    Male     No   Sat  Dinner     3     20.0
240       27.18  2.00  Female    Yes   Sat  Dinner     2      7.0
241       22.67  2.00    Male    Yes   Sat  Dinner     2      9.0
242       17.82  1.75    Male     No   Sat  Dinner     2     10.0
243       18.78  3.00  Female     No  Thur  Dinner     2     16.0

[244 rows x 8 columns]

In [92]:
df1[df1['tip_per'] == df1['tip_per'].max()]

     total_bill   tip   sex smoker  day    time  size  tip_per
172        7.25  5.15  Male    Yes  Sun  Dinner     2     71.0

In [94]:
### 7. Maximum tip given by which size of group

In [109]:
df1['tip_per'].apply(lambda x : str(x) + "%" )[:5]

0                   6.0%
1                  16.0%
2                  17.0%
3    14.000000000000002%
4                  15.0%
Name: tip_per, dtype: object

In [112]:
[tip['tip'].max()]

[10.0]

In [117]:
tip['size'][tip['tip'] == tip['tip'].max()]

170    3
Name: size, dtype: int64

In [118]:
### 8. which group of people is most common?

In [124]:
tip['size'].value_counts()

2    156
3     38
4     37
5      5
6      4
1      4
Name: size, dtype: int64

In [119]:
###9. smokers are maximum from which sex

In [123]:
tip[tip['smoker'] == "Yes"]['sex'].value_counts()

Male      60
Female    33
Name: sex, dtype: int64

In [125]:
###10. on which day tips recived by female is more if female is non smoker?

In [127]:
tip.iloc[tip[tip.sex == 'Female']['tip'].argmax()]['day']

'Sat'

In [129]:
tip[(tip["smoker"] == "No") & (tip["sex"] == "Female")]["day"].value_counts()

Thur    25
Sun     14
Sat     13
Fri      2
Name: day, dtype: int64

In [131]:
tip[(tip['sex']=='female') & (tip['smoker']=='No')]['day'].max()

TypeError: Categorical is not ordered for operation max
you can use .as_ordered() to change the Categorical to an ordered one

In [137]:
temp = tip[(tip['sex'] == "Female") & (tip['smoker'] == "No")]
temp[temp['tip'] == temp['tip'].max()]['day']

52    Sun
Name: day, dtype: category
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [139]:
###11. On which day total bill is less or more

In [143]:
tip.iloc[tip.total_bill.argmin()]['day']

'Sat'

In [144]:
tip.iloc[tip.total_bill.argmax()]['day']

'Sat'

In [147]:
tip.total_bill.argmin()

67

In [148]:
tip.total_bill.argmax()

170

In [149]:
tip[tip["total_bill"]==tip['total_bill'].max()]["day"]

170    Sat
Name: day, dtype: category
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [152]:
tip[tip["total_bill"]==tip['total_bill'].min()]["day"]

67    Sat
Name: day, dtype: category
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [154]:
###12. What is the maximum number of people in a group who are smoker

In [157]:
tip[tip['smoker'] == "Yes"]['size'].max()

5

In [158]:
###13. Count of sizes (groups that peopleare coming) what is frequency of sizes on dinner and male smokers?

In [167]:
tip[(tip.time == "Dinner") & (tip.sex == "Male") & (tip.smoker == "Yes")]['size'].value_counts()

2    31
4     8
3     6
5     2
Name: size, dtype: int64

In [168]:
titanic = sns.load_dataset("titanic")

In [169]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True